'''Реализуйте класс Vector. Свойство coordinates определяет координаты вектора и является экземпляром класса Point.
Напомним, что вектором называют направленный отрезок с началом и концом. Начало у нас будет в точке (0, 0),
а конец вектора мы будем задавать атрибутом coordinates.

Реализуйте возможность обращаться к координатам экземпляра класса Vector через квадратные скобки:

Чтобы получить значение, используя квадратные скобки у объекта print(vector[0]), реализуйте метод __getitem__ у класса Vector.
Для записи значения координат вектора через индекс, как vector[0] = 10, реализуйте метод __setitem__ у класса Vector.
Обращение к координате x производится по индексу 0, а обращение к координате y — по индексу 1.'''

